Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: فعقروا الناقة وعتوا عن أمر ربهم وقالوا يا صالح ائتنا بما تعدنا إن كنت من المرسلين
en: So they killed the she-camel and insolently defied the Commandment of their Lord, and said: "O Salih! Bring about your threats if you are indeed one of the Messengers (of Allah)."

source: فأخذتهم الرجفة فأصبحوا في دارهم جاثمين
en: So the earthquake seized them, and they lay (dead), prostrate in their homes.

source: فتولى عنهم وقال يا قوم لقد أبلغتكم رسالة ربي ونصحت لكم ولكن لا تحبون الناصحين
en: Then he [Salih] turned from them, and said: "O my people! I have indeed conveyed to you the Message of my Lord, and have given you good advice but you like not good advisers."

source: ولوطا إذ قال لقومه أتأتون الفاحشة ما سبقكم بها من أحد من العالمين
en: And (remember) Lut (Lot), when he said to his people: "Do you commit the worst sin such as none preceding you has committed in the 'Alamin (mankind and jinn)?

source: إنكم لتأتون الرجال شهوة من دون النساء بل أنتم قوم مسرفون
en: "Verily, you practise your lusts on men instead of women. Nay, but you are a people transgressing beyond bounds (by committing great sins)."

source: وما كان جواب قومه إلا أن قالوا أخرجوهم من قريتكم إنهم أناس يتطهرون
en: And the answer of his people was only that they said: "Drive them out of your town, these are indeed men who want to be pure (from sins)!"

source: فأنجيناه وأهله إلا امرأته كانت من الغابرين
en: Then We saved him and his family, except his wife; she was of those who remained behind (in the torment).

source: وأمطرنا عليهم مطرا فانظر كيف كان عاقبة المجرمين
en: And We rained down on them a rain (of stones). Then see what was the end of the Mujrimun (criminals, polytheists and sinners).

source: وإلى مدين أخاهم شعيبا قال يا قوم اعبدوا الله ما لكم من إله غيره قد جاءتكم بينة من ربكم فأوفوا الكيل والميزان ولا تبخسوا الناس أشياءهم ولا تفسدوا في الأرض بعد إصلاحها ذلكم خير لكم إن كنتم مؤمنين
en: And to (the people of) Madyan (Midian), (We sent) their brother Shu'aib. He said: "O my people! Worship Allah! You have no other Ilah (God) but Him. [La ilaha illallah (none has the right to be worshipped but Allah)]." Verily, a clear proof (sign) from your Lord has come unto you; so give full measure and full weight and wrong not men in their things, and do not do mischief on the earth after it has been set in order, that will be better for you, if you are believers.

source: ولا تقعدوا بكل صراط توعدون وتصدون عن سبيل الله من آمن به وتبغونها عوجا واذكروا إذ كنتم قليلا فكثركم وانظروا كيف كان عاقبة المفسدين
en: "And sit not on every road, threatening, and hindering from the Path of Allah those who believe in Him, and seeking to make it crooked. And remember when you were but few, and He multiplied you. And see what was the end of the Mufsidun (mischief-makers, corrupters, liars).

source: وإن كان طائفة منكم آمنوا بالذي أرسلت به وطائفة لم يؤمنوا فاصبروا حتى يحكم الله بيننا وهو خير الحاكمين
en: "And if there is a party of you who believe in that with which I have been sent and a party who do not believe, so be patient until Allah judges between us, and He is the Best of judges."

source: قال الملأ الذين استكبروا من قومه لنخرجنك يا شعيب والذين آمنوا معك من قريتنا أو لتعودن في ملتنا قال أولو كنا كارهين
en: The chiefs of those who were arrogant among his people said: "We shall certainly drive you out, O Shu'aib, and those who have believed with you from our town, or else you (all) shall return to our religion." He said: "Even though we hate it!?"

source: قد افترينا على الله كذبا إن عدنا في ملتكم بعد إذ نجانا الله منها وما يكون لنا أن نعود فيها إلا أن يشاء الله ربنا وسع ربنا كل شيء علما على الله توكلنا ربنا افتح بيننا وبين قومنا بالحق وأنت خير الفاتحين
en: "We should have invented a lie against Allah if we returned to your religion, after Allah has rescued us from it. And it is not for us to return to it unless Allah, our Lord, should will. Our Lord comprehends all things in His Knowledge. In Allah (Alone) we put our trust. Our Lord! Judge between us and our people in truth, for You are the Best of those who give judgment."

source: وقال الملأ الذين كفروا من قومه لئن اتبعتم شعيبا إنكم إذا لخاسرون
en: The chiefs of those who disbelieved among his people said (to their people): "If you follow Shu'aib, be sure then you will be the losers!"

source: الذين كذبوا شعيبا كأن لم يغنوا فيها الذين كذبوا شعيبا كانوا هم الخاسرين
en: Those who belied Shu'aib, became as if they had never dwelt there (in their homes). Those who belied Shu'aib, they were the losers.

source: فتولى عنهم وقال يا قوم لقد أبلغتكم رسالات ربي ونصحت لكم فكيف آسى على قوم كافرين
en: Then he (Shu'aib) turned from them and said: "O my people! I have indeed conveyed my Lord's Messages unto you and I have given you good advice. Then how can I sorrow for the disbelieving people's (destruction)."

source: وما أرسلنا في قرية من نبي إلا أخذنا أهلها بالبأساء والضراء لعلهم يضرعون
en: And We sent no Prophet unto any town (and they denied him), but We seized its people with suffering from extreme poverty (or loss in wealth) and loss of health (and calamities), so that they might humiliate themselves (and repent to Allah).

source: ثم بدلنا مكان السيئة الحسنة حتى عفوا وقالوا قد مس آباءنا الضراء والسراء فأخذناهم بغتة وهم لا يشعرون
en: Then We changed the evil for the good, until they increased in number and in wealth, and said: "Our fathers were touched with evil (loss of health and calamities) and with good (prosperity)." So We seized them all of a sudden while they were unaware.

source: ولو أن أهل القرى آمنوا واتقوا لفتحنا عليهم بركات من السماء والأرض ولكن كذبوا فأخذناهم بما كانوا يكسبون
en: And if the people of the towns had believed and had the Taqwa (piety), certainly, We should have opened for them blessings from the heaven and the earth, but they belied (the Messengers). So We took them (with punishment) for what they used to earn (polytheism and crimes).

source: أفأمن أهل القرى أن يأتيهم بأسنا بياتا وهم نائمون
en: Did the people of the towns then feel secure against the coming of Our punishment by night while they were asleep?

source: أوأمن أهل القرى أن يأتيهم بأسنا ضحى وهم يلعبون
en: Or, did the people of the towns then feel secure against the coming of Our punishment in the forenoon while they were playing?

source: أفأمنوا مكر الله فلا يأمن مكر الله إلا القوم الخاسرون
en: Did they then feel secure against the Plan of Allah? None feels secure from the Plan of Allah except the people who are the losers.

source: أولم يهد للذين يرثون الأرض من بعد أهلها أن لو نشاء أصبناهم بذنوبهم ونطبع على قلوبهم فهم لا يسمعون
en: Is it not clear to those who inherit the earth in succession from its (previous) possessors, that had We willed, We would have punished them for their sins. And We seal up their hearts so that they hear not?

source: تلك القرى نقص عليك من أنبائها ولقد جاءتهم رسلهم بالبينات فما كانوا ليؤمنوا بما كذبوا من قبل كذلك يطبع الله على قلوب الكافرين
en: Those were the towns whose story We relate unto you (O Muhammad صلى الله عليه وسلم). And there came indeed to them their Messengers with clear proofs, but they were not such as to believe in that which they had rejected before. Thus Allah does seal up the hearts of the disbelievers (from every kind of religious guidance).

source: وما وجدنا لأكثرهم من عهد وإن وجدنا أكثرهم لفاسقين
en: And most of them We found not true to their covenant, but most of them We found indeed Fasiqun (rebellious, disobedient to Allah).

source: ثم بعثنا من بعدهم موسى بآياتنا إلى فرعون وملئه فظلموا بها فانظر كيف كان عاقبة المفسدين
en: Then after them We sent Musa (Moses) with Our Signs to Fir'aun (Pharaoh) and his chiefs, but they wrongfully rejected them. So see how was the end of the Mufsidun (mischief-makers, corrupters).

source: وقال موسى يا فرعون إني رسول من رب العالمين
en: And Musa (Moses) said: "O Fir'aun (Pharaoh)! Verily, I am a Messenger from the Lord of the 'Alamin (mankind, jinn and all that exists).

source: حقيق على أن لا أقول على الله إلا الحق قد جئتكم ببينة من ربكم فأرسل معي بني إسرائيل
en: "Proper it is for me that I say nothing concerning Allah but the truth. Indeed I have come unto you from your Lord with a clear proof. So let the Children of Israel depart along with me."

source: قال إن كنت جئت بآية فأت بها إن كنت من الصادقين
en: [Fir'aun (Pharaoh)] said: "If you have come with a sign, show it forth, if you are one of those who tell the truth."

source: فألقى عصاه فإذا هي ثعبان مبين
en: Then [Musa (Moses)] threw his stick and behold! it was a serpent, manifest!

source: ونزع يده فإذا هي بيضاء للناظرين
en: And he drew out his hand, and behold! it was white (with radiance) for the beholders.

source: قال الملأ من قوم فرعون إن هذا لساحر عليم
en: The chiefs of the people of Fir'aun (Pharaoh) said: "This is indeed a well-versed sorcerer;

source: يريد أن يخرجكم من أرضكم فماذا تأمرون
en: "He wants to get you out of your land, so what do you advise?"

source: قالوا أرجه وأخاه وأرسل في المدائن حاشرين
en: They said: "Put him and his brother off (for a time), and send callers to the cities to collect -

source: يأتوك بكل ساحر عليم
en: "That they bring up to you all well-versed sorcerers."

source: وجاء السحرة فرعون قالوا إن لنا لأجرا إن كنا نحن الغالبين
en: And so the sorcerers came to Fir'aun (Pharaoh). They said: "Indeed there will be a (good) reward for us if we are the victors."

source: قال نعم وإنكم لمن المقربين
en: He said: "Yes, and moreover you will (in that case) be of the nearest (to me)."

source: قالوا يا موسى إما أن تلقي وإما أن نكون نحن الملقين
en: They said: "O Musa (Moses)! Either you throw (first), or shall we have the (first) throw?"

source: قال ألقوا فلما ألقوا سحروا أعين الناس واسترهبوهم وجاءوا بسحر عظيم
en: He [Musa (Moses)] said: "Throw you (first)." So when they threw, they bewitched the eyes of the people, and struck terror into them, and they displayed a great magic.

source: وأوحينا إلى موسى أن ألق عصاك فإذا هي تلقف ما يأفكون
en: And We revealed to Musa (Moses) (saying): "Throw your stick," and behold! It swallowed up straight away all the falsehoods which they showed.

source: فوقع الحق وبطل ما كانوا يعملون
en: Thus truth was confirmed, and all that they did was made of no effect.

source: فغلبوا هنالك وانقلبوا صاغرين
en: So they were defeated there and returned disgraced.

source: وألقي السحرة ساجدين
en: And the sorcerers fell down prostrate.

source: قالوا آمنا برب العالمين
en: They said: "We believe in the Lord of the 'Alamin (mankind, jinn and all that exists).

source: رب موسى وهارون
en: "The Lord of Musa (Moses) and Harun (Aaron)."

source: قال فرعون آمنتم به قبل أن آذن لكم إن هذا لمكر مكرتموه في المدينة لتخرجوا منها أهلها فسوف تعلمون
en: Fir'aun (Pharaoh) said: "You have believed in him [Musa (Moses)] before I give you permission. Surely, this is a plot which you have plotted in the city to drive out its people, but you shall come to know.

source: لأقطعن أيديكم وأرجلكم من خلاف ثم لأصلبنكم أجمعين
en: "Surely, I will cut off your hands and your feet from opposite sides, then I will crucify you all."

source: قالوا إنا إلى ربنا منقلبون
en: They said: "Verily, we are returning to our Lord.

source: وما تنقم منا إلا أن آمنا بآيات ربنا لما جاءتنا ربنا أفرغ علينا صبرا وتوفنا مسلمين
en: "And you take vengeance on us only because we believed in the Ayat (proofs, evidence, lessons, signs, etc.) of our Lord when they reached us! Our Lord! pour out on us patience, and cause us to die as Muslims."

source: وقال الملأ من قوم فرعون أتذر موسى وقومه ليفسدوا في الأرض ويذرك وآلهتك قال سنقتل أبناءهم ونستحيي نساءهم وإنا فوقهم قاهرون
en: The chiefs of Fir'aun's (Pharaoh) people said: "Will you leave Musa (Moses) and his people to spread mischief in the land, and to abandon you and your gods?" He said: "We will kill their sons, and let live their women, and we have indeed irresistible power over them."

source: قال موسى لقومه استعينوا بالله واصبروا إن الأرض لله يورثها من يشاء من عباده والعاقبة للمتقين
en: Musa (Moses) said to his people: "Seek help in Allah and be patient. Verily, the earth is Allah's. He gives it as a heritage to whom He wills of His slaves; and the (blessed) end is for the Muttaqun (the pious - see V.2:2)."

source: قالوا أوذينا من قبل أن تأتينا ومن بعد ما جئتنا قال عسى ربكم أن يهلك عدوكم ويستخلفكم في الأرض فينظر كيف تعملون
en: They said: "We (Children of Israel) had suffered troubles before you came to us, and since you have come to us." He said: "It may be that your Lord will destroy your enemy and make you successors on the earth, so that He may see how you act?"

source: ولقد أخذنا آل فرعون بالسنين ونقص من الثمرات لعلهم يذكرون
en: And indeed We punished the people of Fir'aun (Pharaoh) with years of drought and shortness of fruits (crops), that they might remember (take heed).

source: فإذا جاءتهم الحسنة قالوا لنا هذه وإن تصبهم سيئة يطيروا بموسى ومن معه ألا إنما طائرهم عند الله ولكن أكثرهم لا يعلمون
en: But whenever good came to them, they said: "Ours is this." And if evil afflicted them, they ascribed it to evil omens connected with Musa (Moses) and those with him. Be informed! Verily, their evil omens are with Allah but most of them know not.

source: وقالوا مهما تأتنا به من آية لتسحرنا بها فما نحن لك بمؤمنين
en: They said [to Musa (Moses)]: "Whatever Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) you may bring to us, to work therewith your sorcery on us, we shall never believe in you."

source: فأرسلنا عليهم الطوفان والجراد والقمل والضفادع والدم آيات مفصلات فاستكبروا وكانوا قوما مجرمين
en: So We sent on them: the flood, the locusts, the lice, the frogs, and the blood (as a succession of) manifest signs, yet they remained arrogant, and they were of those people who were Mujrimun (criminals, polytheists, sinners).

source: ولما وقع عليهم الرجز قالوا يا موسى ادع لنا ربك بما عهد عندك لئن كشفت عنا الرجز لنؤمنن لك ولنرسلن معك بني إسرائيل
en: And when the punishment fell on them they said: "O Musa (Moses)! Invoke your Lord for us because of His Promise to you. If you remove the punishment from us, we indeed shall believe in you, and we shall let the Children of Israel go with you."

source: فلما كشفنا عنهم الرجز إلى أجل هم بالغوه إذا هم ينكثون
en: But when We removed the punishment from them to a fixed term, which they had to reach, behold! they broke their word!

source: فانتقمنا منهم فأغرقناهم في اليم بأنهم كذبوا بآياتنا وكانوا عنها غافلين
en: So We took retribution from them. We drowned them in the sea, because they belied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) and were heedless about them.

source: وأورثنا القوم الذين كانوا يستضعفون مشارق الأرض ومغاربها التي باركنا فيها وتمت كلمت ربك الحسنى على بني إسرائيل بما صبروا ودمرنا ما كان يصنع فرعون وقومه وما كانوا يعرشون
en: And We made the people who were considered weak to inherit the eastern parts of the land and the western parts thereof which We have blessed. And the fair Word of your Lord was fulfilled for the Children of Israel, because of their endurance. And We destroyed completely all the great works and buildings which Fir'aun (Pharaoh) and his people erected.

source: وجاوزنا ببني إسرائيل البحر فأتوا على قوم يعكفون على أصنام لهم قالوا يا موسى اجعل لنا إلها كما لهم آلهة قال إنكم قوم تجهلون
en: And We brought the Children of Israel (with safety) across the sea, and they came upon a people devoted to some of their idols (in worship). They said: "O Musa (Moses)! Make for us an ilah (a god) as they have alihah (gods)." He said: "Verily, you are a people who know not (the Majesty and Greatness of Allah and what is obligatory upon you, i.e. to worship none but Allah Alone, the One and the Only God of all that exists)."

source: إن هؤلاء متبر ما هم فيه وباطل ما كانوا يعملون
en: [Musa (Moses) added:] "Verily, these people will be destroyed for that which they are engaged in (idols-worship). And all that they are doing is in vain."

source: قال أغير الله أبغيكم إلها وهو فضلكم على العالمين
en: He said: "Shall I seek for you an Ilah (a god) other than Allah, while He has given you superiority over the 'Alamin (mankind and jinn of your time)."

source: وإذ أنجيناكم من آل فرعون يسومونكم سوء العذاب يقتلون أبناءكم ويستحيون نساءكم وفي ذلكم بلاء من ربكم عظيم
en: And (remember) when We rescued you from Fir'aun's (Pharaoh) people, who were afflicting you with the worst torment, killing your sons and letting your women live. And in that was a great trial from your Lord.

source: وواعدنا موسى ثلاثين ليلة وأتممناها بعشر فتم ميقات ربه أربعين ليلة وقال موسى لأخيه هارون اخلفني في قومي وأصلح ولا تتبع سبيل المفسدين
en: And We appointed for Musa (Moses) thirty nights and added (to the period) ten (more), and he completed the term, appointed by his Lord, of forty nights. And Musa (Moses) said to his brother Harun (Aaron): "Replace me among my people, act in the Right Way (by ordering the people to obey Allah and to worship Him Alone) and follow not the way of the Mufsidun (mischief-makers)."

source: ولما جاء موسى لميقاتنا وكلمه ربه قال رب أرني أنظر إليك قال لن تراني ولكن انظر إلى الجبل فإن استقر مكانه فسوف تراني فلما تجلى ربه للجبل جعله دكا وخر موسى صعقا فلما أفاق قال سبحانك تبت إليك وأنا أول المؤمنين
en: And when Musa (Moses) came at the time and place appointed by Us, and his Lord (Allah) spoke to him; he said: "O my Lord! Show me (Yourself), that I may look upon You." Allah said: "You cannot see Me, but look upon the mountain; if it stands still in its place then you shall see Me." So when his Lord appeared to the mountain , He made it collapse to dust, and Musa (Moses) fell down unconscious. Then when he recovered his senses he said: "Glory be to You, I turn to You in repentance and I am the first of the believers."

source: قال يا موسى إني اصطفيتك على الناس برسالاتي وبكلامي فخذ ما آتيتك وكن من الشاكرين
en: (Allah) said: "O Musa (Moses) I have chosen you above men by My Messages, and by My speaking (to you). So hold that which I have given you and be of the grateful."

source: وكتبنا له في الألواح من كل شيء موعظة وتفصيلا لكل شيء فخذها بقوة وأمر قومك يأخذوا بأحسنها سأريكم دار الفاسقين
en: And We wrote for him on the Tablets the lesson to be drawn from all things and the explanation for all things (and said): Hold unto these with firmness, and enjoin your people to take the better therein. I shall show you the home of Al-Fasiqun (the rebellious, disobedient to Allah).

source: سأصرف عن آياتي الذين يتكبرون في الأرض بغير الحق وإن يروا كل آية لا يؤمنوا بها وإن يروا سبيل الرشد لا يتخذوه سبيلا وإن يروا سبيل الغي يتخذوه سبيلا ذلك بأنهم كذبوا بآياتنا وكانوا عنها غافلين
en: I shall turn away from My Ayat (verses of the Qur'an) those who behave arrogantly on the earth, without a right, and (even) if they see all the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), they will not believe in them. And if they see the way of righteousness (monotheism, piety, and good deeds), they will not adopt it as the Way, but if they see the way of error (polytheism, crimes and evil deeds), they will adopt that way, that is because they have rejected Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) and were heedless (to learn a lesson) from them.

source: والذين كذبوا بآياتنا ولقاء الآخرة حبطت أعمالهم هل يجزون إلا ما كانوا يعملون
en: Those who deny Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) and the Meeting in the Hereafter (Day of Resurrection,), vain are their deeds. Are they requited with anything except what they used to do?

source: واتخذ قوم موسى من بعده من حليهم عجلا جسدا له خوار ألم يروا أنه لا يكلمهم ولا يهديهم سبيلا اتخذوه وكانوا ظالمين
en: And the people of Musa (Moses) made in his absence, out of their ornaments, the image of a calf (for worship). It had a sound (as if it was mooing). Did they not see that it could neither speak to them nor guide them to the way? They took it (for worship) and they were Zalimun (wrong-doers).

source: ولما سقط في أيديهم ورأوا أنهم قد ضلوا قالوا لئن لم يرحمنا ربنا ويغفر لنا لنكونن من الخاسرين
en: And when they regretted and saw that they had gone astray, they (repented and) said: "If our Lord have not mercy upon us and forgive us, we shall certainly be of the losers."

source: ولما رجع موسى إلى قومه غضبان أسفا قال بئسما خلفتموني من بعدي أعجلتم أمر ربكم وألقى الألواح وأخذ برأس أخيه يجره إليه قال ابن أم إن القوم استضعفوني وكادوا يقتلونني فلا تشمت بي الأعداء ولا تجعلني مع القوم الظالمين
en: And when Musa (Moses) returned to his people, angry and grieved, he said: "What an evil thing is that which you have done (i.e. worshipping the calf) during my absence. Did you hasten and go ahead as regards the matter of your Lord (you left His worship)?" And he threw down the Tablets and seized his brother by (the hair of) his head and dragged him towards him. Harun (Aaron) said: "O son of my mother! Indeed the people judged me weak and were about to kill me, so make not the enemies rejoice over me, nor put me amongst the people who are Zalimun (wrong-doers)."

source: قال رب اغفر لي ولأخي وأدخلنا في رحمتك وأنت أرحم الراحمين
en: Musa (Moses) said: "O my Lord! Forgive me and my brother, and admit us into Your Mercy, for you are the Most Merciful of those who show mercy."

source: إن الذين اتخذوا العجل سينالهم غضب من ربهم وذلة في الحياة الدنيا وكذلك نجزي المفترين
en: Certainly, those who took the calf (for worship), wrath from their Lord and humiliation will come upon them in the life of this world. Thus do We recompense those who invent lies.

source: والذين عملوا السيئات ثم تابوا من بعدها وآمنوا إن ربك من بعدها لغفور رحيم
en: But those who committed evil deeds and then repented afterwards and believed, verily, your Lord after (all) that is indeed Oft-Forgiving, Most Merciful.

source: ولما سكت عن موسى الغضب أخذ الألواح وفي نسختها هدى ورحمة للذين هم لربهم يرهبون
en: And when the anger of Musa (Moses) was calmed down, he took up the Tablets; and in their inscription was guidance and mercy for those who fear their Lord.

source: واختار موسى قومه سبعين رجلا لميقاتنا فلما أخذتهم الرجفة قال رب لو شئت أهلكتهم من قبل وإياي أتهلكنا بما فعل السفهاء منا إن هي إلا فتنتك تضل بها من تشاء وتهدي من تشاء أنت ولينا فاغفر لنا وارحمنا وأنت خير الغافرين
en: And Musa (Moses) chose out of his people seventy (of the best) men for Our appointed time and place of meeting, and when they were seized with a violent earthquake, he said: "O my Lord, if it had been Your Will, You could have destroyed them and me before; would You destroy us for the deeds of the foolish ones among us? It is only Your Trial by which You lead astray whom You will, and keep guided whom You will. You are our Wali (Protector), so forgive us and have Mercy on us: for You are the Best of those who forgive.

source: واكتب لنا في هذه الدنيا حسنة وفي الآخرة إنا هدنا إليك قال عذابي أصيب به من أشاء ورحمتي وسعت كل شيء فسأكتبها للذين يتقون ويؤتون الزكاة والذين هم بآياتنا يؤمنون
en: "And ordain for us good in this world, and in the Hereafter. Certainly we have turned unto You." He said: (As to) My punishment I afflict therewith whom I will and My Mercy embraces all things. That (Mercy) I shall ordain for those who are the Muttaqun (the pious - See V.2:2), and give Zakat; and those who believe in Our Ayat (proofs, evidence, verses, lessons, signs and revelations, etc.);
